SzymonKwiecinski/Implementation-of-the-HMI-panel-on-a-discovery-kit-containing-a-STM32-microcontroller/Oprogramowani dla panlu HMI/Moj_1/Core/Src/main.cpp
  /*Configure GPIO pin : OTG_FS_VBUS_Pin */
  GPIO_InitStruct.Pin = OTG_FS_VBUS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_VBUS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : Audio_INT_Pin */
  GPIO_InitStruct.Pin = Audio_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(Audio_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_PowerSwitchOn_Pin */
  GPIO_InitStruct.Pin = OTG_FS_PowerSwitchOn_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(OTG_FS_PowerSwitchOn_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D7_Pin ARDUINO_D8_Pin LCD_DISP_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D7_Pin|ARDUINO_D8_Pin|LCD_DISP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

  /*Configure GPIO pin : uSD_Detect_Pin */
  GPIO_InitStruct.Pin = uSD_Detect_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(uSD_Detect_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_BL_CTRL_Pin */
  GPIO_InitStruct.Pin = LCD_BL_CTRL_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
  GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for FATFS */
  MX_FATFS_Init();

  /* init code for USB_HOST */
  MX_USB_HOST_Init();

/* Graphic application */
  GRAPHICS_MainTask();
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }

}



extern xQueueHandle QueueSend;
extern xQueueHandle QueueReceive;
extern xQueueHandle QueueSendSliderValue;
extern xQueueHandle QueueReceiveEncoderValue;
int sliderCurrenValue = 0;
//int encoderValue[]={0,0,0,0};
char sliderCurrentValueChar[4];
uint8_t sterowanieSend=0;//stm32->komputer
uint8_t command1[]="sp=0000=0000=0000=0000\n";//Up => sp=FR=FL=RR=RL\n
uint8_t command2[]="sp=-0000=-0000=-0000=-0000\n";//Down
uint8_t command3[]="sp=0000=-0000=-0000=0000\n";//Right
uint8_t command4[]="sp=-0000=0000=0000=-0000\n";//Left
uint8_t command5[]="sp=0000=-0000=0000=-0000\n";//RightRotaion
uint8_t command6[]="sp=-0000=0000=-0000=0000\n";//LeftRotaion
uint8_t command7[]="sp=0000=0000=0000=0000\n";//Stop
uint8_t bufferReceiveBack[]="Speed=-0000=-0000=-0000=-00000000000\n";
uint8_t bufferReceiveBackFiltr[]="Speed=-0000=-0000=-0000=-00000000000\n";

void StartUartTask(void const * argument)
{
	uint8_t statusReceiveUART6 = 10;
	uint8_t statusConnectUART6 = 10;
	uint8_t helpValue1 = 8;
	uint8_t helpValue2 = 1;
	uint8_t uBuffer = 0;
	BSP_LED_Init(LED_GREEN);
  for(;;)
  {
	  sterowanieSend = 0;

	  if((xQueueReceive(QueueSend, &sterowanieSend, 1))==pdTRUE)
	  {
		  BSP_LED_Toggle(LED_GREEN);

		  if(sterowanieSend == 1)//Move up
		  {
			  HAL_UART_Transmit_IT(&huart1, command1, sizeof(command1)-1);
			  HAL_UART_Transmit_IT(&huart6, command1, sizeof(command1)-1);
		  }
		  if(sterowanieSend == 2)//Move down
		  {
			  HAL_UART_Transmit_IT(&huart1, command2, sizeof(command2)-1);
			  HAL_UART_Transmit_IT(&huart6, command2, sizeof(command2)-1);
		  }
		  if(sterowanieSend == 3)//Move right
		  {
		  	  HAL_UART_Transmit_IT(&huart1, command3, sizeof(command3)-1);
		  	  HAL_UART_Transmit_IT(&huart6, command3, sizeof(command3)-1);
		  }
		  if(sterowanieSend == 4)//Move left
		  {
		  	  HAL_UART_Transmit_IT(&huart1, command4, sizeof(command4)-1);
			  HAL_UART_Transmit_IT(&huart6, command4, sizeof(command4)-1);
		  }
		  if(sterowanieSend == 5)//Right rotation
		  {
		  	  HAL_UART_Transmit_IT(&huart1, command5, sizeof(command5)-1);
			  HAL_UART_Transmit_IT(&huart6, command5, sizeof(command5)-1);
		  }
		  if(sterowanieSend == 6)//Left rotation
		  {
		  	  HAL_UART_Transmit_IT(&huart1, command6, sizeof(command6)-1);
			  HAL_UART_Transmit_IT(&huart6, command6, sizeof(command6)-1);
		  }
		  if(sterowanieSend == 7)//Stop
		  {
		  	  HAL_UART_Transmit_IT(&huart1, command7, sizeof(command7)-1);
			  HAL_UART_Transmit_IT(&huart6, command7, sizeof(command7)-1);
		  }
	  }

	if((xQueueReceive(QueueSendSliderValue, &sliderCurrenValue, 1))==pdTRUE)
	{
		itoa(sliderCurrenValue,sliderCurrentValueChar,10);
		IntToString(sliderCurrentValueChar, sliderCurrenValue);
		UpdateSpeedValue((char*)command1, sliderCurrentValueChar);
		UpdateSpeedValue((char*)command2, sliderCurrentValueChar);
		UpdateSpeedValue((char*)command3, sliderCurrentValueChar);
		UpdateSpeedValue((char*)command4, sliderCurrentValueChar);
		UpdateSpeedValue((char*)command5, sliderCurrentValueChar);
		UpdateSpeedValue((char*)command6, sliderCurrentValueChar);
	}

	statusReceiveUART6 = HAL_UART_Receive_IT(&huart6, bufferReceiveBack, sizeof(bufferReceiveBack));
	if( statusReceiveUART6 == 0)
	{
		HAL_UART_Transmit_IT(&huart1, bufferReceiveBack, sizeof(bufferReceiveBack));
	}

