SzymonKwiecinski/Implementation-of-the-HMI-panel-on-a-discovery-kit-containing-a-STM32-microcontroller/Oprogramowani dla panlu HMI/Moj_1/Core/Src/main.cpp
	statusConnectUART6 = HAL_UART_Receive_IT(&huart6, &helpValue1, 1);
	if(statusConnectUART6 == 0)
	{
		xQueueSend(QueueReceive,&helpValue2,0);
	}

	if( statusReceiveUART6 == 0)
	{
		bufferReceiveBack[sizeof(bufferReceiveBack)-1] = '\n';
		while(!(bufferReceiveBack[uBuffer] == '\n'))
		{
			bufferReceiveBackFiltr[uBuffer] = bufferReceiveBack[uBuffer];
			uBuffer = uBuffer + 1;
		}
		bufferReceiveBackFiltr[sizeof(bufferReceiveBackFiltr)] = '\n';
		//HAL_UART_Transmit_IT(&huart1, bufferReceiveBackFiltr, uBuffer+1);
		uBuffer = 0;
		//StringToInt(bufferReceiveBackFiltr);//, encoderValue);
		xQueueSend(QueueReceiveEncoderValue,encoderValue,0);
		statusReceiveUART6 = 10;
	}
  }
}



void StringToInt(uint8_t *tab)//,int *encoderValueTab)
{
int i = 0;
int j = 0;
int d = 0;
char tab2[]="-1000\n";
bool v = true;

while(!(tab[i] == '\n'))
{
    if(tab[i] == '=')
    {
        v = true;
        i=i+1;
        while(v)
        {
            tab2[j] = tab[i];
            j=j+1;
            i=i+1;
            if(tab[i] == '=')
            {
                v = false;
            }
            else if(tab[i] == '\n')
            {
                v = false;
            }
        }
        tab2[j]= '\0';
        encoderValue[d] =  atoi(tab2);
        d=d+1;
        j = 0;
        i=i-1;
    }
i=i+1;
}
}

//zamienia liczbe na czteroelementowa tablice charów
//wypelnia poczatek zerami kiedy trzeba np. 32=> 0032
void IntToString(char *sliderValueChar,int sliderValue)
{
    if(sliderValue<10)
    {
    	sliderValueChar[3]=sliderValueChar[0];
    	sliderValueChar[0]='0';
    	sliderValueChar[1]='0';
    	sliderValueChar[2]='0';
    }
    else if((sliderValue>9) &&  (sliderValue<100))
    {
    	sliderValueChar[3]=sliderValueChar[1];
    	sliderValueChar[2]=sliderValueChar[0];
    	sliderValueChar[1]='0';
    	sliderValueChar[2]='0';
    }
    else if(sliderValue<1000 && sliderValue>99)
    {
    	sliderValueChar[3]=sliderValueChar[2];
    	sliderValueChar[2]=sliderValueChar[1];
    	sliderValueChar[1]=sliderValueChar[0];
    	sliderValueChar[0]='0';
    }
}

void UpdateSpeedValue(char *command,char *sliderValueChar)
{
    int i=0;
    int j=0;
    while(!(command[i]=='\n'))
    {
        if( (command[i] == '=') && (command[i+1] == '-') )
        {
            for(j=0;j<=3;j++)
            {
            	command[i+2+j]=sliderValueChar[j];
            }
        }
         else if( (command[i] == '=') && !(command[i+1] == '-') )
        {
            for(j=0;j<=3;j++)
            {
            	command[i+1+j]=sliderValueChar[j];
            }
        }
        i++;
    }
}






 /* USER CODE END 5 */

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{

}
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{

}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
